Tekla Open API Reference for Tekla Structures 2025
PourBreak.PourBreakAttributes.DrawHiddenLines Property
 Indicates whether hidden lines are used to draw the pour break or not.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DrawHiddenLines { get; set; }
Public Property DrawHiddenLines As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PourBreak.PourBreakAttributes Class
Tekla.Structures.Drawing Namespace